---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.DimensionWithoutParameter
source: html/d36c8b49-6741-c36f-7b50-90e212a35638.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.DimensionWithoutParameter Property

Dimension has no parameter assigned to it.

## Syntax (C#)
```csharp
public static FailureDefinitionId DimensionWithoutParameter { get; }
```